Autodesk.Revit.DB.Options.set_CanComputeReferences(System.Boolean)
Enables computing of references to geometric objects.

Autodesk.Revit.DB.Options.get_CanComputeReferences
Checks whether references to geometric objects are computed.

Autodesk.Revit.DB.Options.CanComputeReferences
Determines whether or not references to geometric objects are allowed.

Autodesk.Revit.DB.Options.IncludeNonVisibleObjects
Whether to extract element geometry objects not set as Visible.  The default is false.

Autodesk.Revit.DB.Options.set_View(Autodesk.Revit.DB.View)
Sets the view that drives extraction of geometry.

Autodesk.Revit.DB.Options.get_View
Retrieves the view that was set for this object.

Autodesk.Revit.DB.Options.View
The view used for geometry extraction.
Remarks: If a view-specific version of an element exists, it will be extracted in the
retrieval of geometry. Also, the detail level of the geometry will be taken from the
view's detail level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when setting this property with a null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when setting this property,
if DetailLevel is already set.  When DetailLevel is set view-specific geometry can't be
extracted.

Autodesk.Revit.DB.Options.set_ComputeReferences(System.Boolean)
Enables computing of references to geometric objects.

Autodesk.Revit.DB.Options.get_ComputeReferences
Checks whether references to geometric objects are computed.

Autodesk.Revit.DB.Options.ComputeReferences
Determines whether or not references to geometric objects are computed.

Autodesk.Revit.DB.Options.set_DetailLevel(Autodesk.Revit.DB.ViewDetailLevel)
Sets the preferred detail level.

Autodesk.Revit.DB.Options.get_DetailLevel
Returns the preferred detail level.

Autodesk.Revit.DB.Options.DetailLevel
The detail level for the geometry extracted with these options.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when setting this property,
if View is already set.  When View is set the detail level of the view is used.

Autodesk.Revit.DB.Options.#ctor(Autodesk.Revit.DB.Options)
Copy constructor.

Autodesk.Revit.DB.Options.#ctor
Creates a default Options object.
Remarks: Defaults to medium detail, no references and no view.

Autodesk.Revit.DB.Options
User preferences for parsing of geometry.
Remarks: This class determines the output of the Element.Geometry property.